import type { ReactNode } from 'react'
import {
    CartridgeIcon,
    RepairIcon,
    EnterpriseIcon,
} from '../components/ui/Icon/icons'

export interface Service {
    id: string
    title: string
    icon: ReactNode
    perks: string[]
    details?: string
    detailsSecond?: string
    detailsThird?: string
    detailsFourth?: string
    detailPrice?: string
    detailPriceSecond?: string
    detailPriceThird?: string
    png?: string
}

export const servicesData: Service[] = [
    {
        id: 'cartridge',
        title: 'Заправка картриджей',
        icon: <CartridgeIcon />,
        perks: [
            'Быстрая заправка от 15 минут премиальным тонером',
            'Обязательная полная очистка бункера и замена чипов',
            'Контрольное тестирование качества печати перед выдачей',
        ],
        details:
            'Профессионально выполняем заправку лазерных картриджей, ремонт и обслуживание лазерных принтеров, МФУ, сканеров, струйных принтеров, плоттеров. \n\nГарантируем качественную диагностику и надежный ремонт с использованием оригинальных запчастей.',
        detailsSecond:
            'В стоимость заправки картриджей входит не только заполнение тонером, но и обязательная полная очистка бункера от остатков старого тонера, проверка и восстановление фотобарабана (при необходимости), а также обязательная замена чипа. \n\nПеред выдачей каждый картридж проходит контрольное тестирование на профессиональном оборудовании для подтверждения качества печати. \n\nМы используем только проверенные и качественные марки тонера, что гарантирует отличный результат и долговечность работы картриджа.',
        detailPrice: 'Диагностика — БЕСПЛАТНО',
        detailPriceSecond: 'Заправка — от 800₽',
        detailPriceThird: 'Восстановление - от 700₽',
        png: '/images/services/cartridge.webp',
    },
    {
        id: 'repair',
        title: 'Ремонт оргтехники и ноутбуков',
        icon: <RepairIcon />,
        perks: [
            'Бесплатная точная диагностика при согласии на ремонт',
            'Сложный компонентный ремонт плат, замена матриц и термопасты',
            'Оригинальные запчасти и проверенные надежные аналоги',
        ],
        details:
            'В современном мире оргтехника является неотъемлемой частью рабочего процесса, обеспечивая эффективность и продуктивность. Однако, как и любое сложное техническое устройство, она требует регулярного обслуживания для поддержания своей надежной работы. \n\nПоломка или некорректная работа оргтехники может привести к серьезным перебоям в работе офиса, снижению производительности и потере драгоценного времени сотрудников. Именно поэтому важно своевременно обращаться к профессионалам для проведения диагностики и ремонта. Мы предлагаем качественный ремонт оргтехники и ноутбуков любой сложности, гарантируя восстановление работоспособности и продление срока службы вашего оборудования. ',
        detailsSecond:
            'Сервисный специалист проводит проверку системы подачи бумаги, настройку печатных головок и калибровку цветопередачи. Регулярная проверка и регулировка механизмов помогают предотвратить возможные сбои и обеспечить точность и надежность работы устройства.',
        detailsThird:
            'Профессионально выполняем диагностику, ремонт и модернизацию компьютеров, ноутбуков, нетбуков и их комплектующих.',
        detailsFourth:
            'Выполняем восстановление операционной системы и данных клиента после вирусной атаки или аппаратного сбоя оборудования. Настраиваем ПО клиента под конфигурацию его оборудования (выполняем оптимизацию операционной системы, файловой системы, конфигурирование программ).',
        detailPrice: 'Диагностика — от 1000₽',
        detailPriceSecond: 'Ремонт — от 4500₽',
        png: '/images/services/repair.webp',
    },
    {
        id: 'enterprise',
        title: 'Комплексное обслуживание предприятий',
        icon: <EnterpriseIcon />,
        perks: [
            'Официальный договор, закрывающие документы и безналичный расчёт',
            'Регулярная профилактика для исключения простоев офиса',
            'Приоритетный выезд инженера и персональный менеджер',
        ],
        details:
            'Мы предлагаем профессиональное комплексное сервисное обслуживание, которое поможет вашему предприятию поддерживать высокую производительность и продлить срок службы оборудования. ',
        detailsSecond:
            'Наши специалисты проводят все необходимые работы по техническому обслуживанию оборудования.',
        detailsThird:
            'Доверьте сервисное обслуживание Вашей оргтехники профессионалам и обеспечьте бесперебойную работу вашего предприятия.',
        detailPrice: 'Взаимовыгодные договорные отношения.',
        detailPriceSecond: 'Индивидуальный подход к каждому клиенту.',
        png: '/images/services/enterprise.webp',
    },
]